Wavetrend/RX14XX-TestApp/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.145.0
        Device            :  PIC24FJ256GB206
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.36b
        MPLAB 	          :  MPLAB X v5.25
*/

/*
    (c) 2019 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

/**
  Section: Included Files
*/
#include <stdio.h>
#include <stdbool.h>
#include <p24FJ256GB206.h>

#include "mcc_generated_files/system.h"
#include "mcc_generated_files/pin_manager.h"

#include "utlist.h"

#include "wtapi_circular_buffer.h"

WTAPI_DECLARE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);
WTAPI_DEFINE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);

/*
                         Main application
 */

////////////////////////////////// TMR ///////////////////////////////////////

typedef struct {
    
    bool (*start)(void * const context, uint32_t const msecs);
    bool (*stop)(void * const context);
    
} wthal_timer_impl_t;

typedef struct {
    
    wthal_timer_impl_t * impl;
    void * context;
    
} wthal_timer_t;

wthal_timer_t * const wthal_timer_init(wthal_timer_t * const self, wthal_timer_impl_t * const impl, void * const context) {
    self->impl = impl;
    self->context = context;
    return self;
}

bool wthal_timer_start(wthal_timer_t * const self, uint32_t const msecs) {
    return self->impl->start(self->context, msecs);
}

bool wthal_timer_stop(wthal_timer_t * const self) {
    return self->impl->stop(self->context);
}

//---------------------------------
// XTAL 14745600

typedef enum { 
    wt_rx14xx_timer_prescale_1 = 0,
    wt_rx14xx_timer_prescale_8 = 1,
    wt_rx14xx_timer_prescale_64 = 2,
    wt_rx14xx_timer_prescale_256 = 3,
} wt_rx14xx_timer_prescale_t;

#define DEFINE_TIMER(NAME, XTAL, TIMER, PERIOD, TON, TCKPS, IF) \
    typedef struct { \
        wthal_timer_t timer; \
    } NAME ## _t; \
    static bool start_impl(void * const context, uint32_t const msecs) { \
        float prescale[4] = { 1, 8, 64, 256 }; \
        bool ok = true; \
        TON = 0; \
        uint32_t period = ((XTAL / prescale[TCKPS]) / 1000) * msecs; \
        if (period <= UINT16_MAX) { \
            PERIOD = (uint16_t)period; \
            TIMER = 0; \
            IF = 0; \
            TON = 1; \
        } else { \
            ok = false; \
        } \
        return true; \
    } \
    static bool stop_impl(void * const context) { \
        TON = 0; \
        return true; \
    } \
    static wthal_timer_impl_t NAME ## _impl = { \
        .start = start_impl, \
        .stop = stop_impl, \
    }; \
    wthal_timer_t * const NAME ## _init(NAME ## _t * const self, wt_rx14xx_timer_prescale_t const prescale) { \
        TON = 0; \
        TIMER = 0; \
        TCKPS = prescale; \
        return wthal_timer_init(&self->timer, &NAME ## _impl, self); \
    }

DEFINE_TIMER(wt_rx14xx_timer5, 7372800, TMR5, PR5, T5CONbits.TON, T5CONbits.TCKPS, _T5IF)

//-------------------------

typedef struct {
    uint32_t volatile count;
} wthal_counter_t;

wthal_counter_t * const wthal_counter_init(wthal_counter_t * const self) {
    self->count = 0;
    return self;
}

bool wthal_counter_reset(wthal_counter_t * const self) {
    self->count = 0;
    return true;
}

bool wthal_counter_increment(wthal_counter_t * const self) {
    self->count++;
    return true;
}

uint32_t wthal_counter_get(wthal_counter_t * const self) {
    return self->count;
}

void wthal_counter_isr(void * const context) {
    wthal_counter_t * const counter = context;
    wthal_counter_increment(counter);
}

//-----------------------------------

typedef struct wthal_observer_tag wthal_observer_t;

struct wthal_observer_tag {
    void (*callback)(void * const context);
    void * context;
    wthal_observer_t * volatile next;
    wthal_observer_t * volatile prev;
};

typedef struct {
    wthal_observer_t * volatile head;
} wthal_observers_t;

void wthal_observers_dispatch(wthal_observers_t * const self) {
    wthal_observer_t * el, * tmp;
    DL_FOREACH_SAFE(self->head, el, tmp) {
        el->callback(el->context);
    }
}

wthal_observer_t * wthal_observers_head(wthal_observers_t * const self) {
    return self->head;
}

bool wthal_observers_add(wthal_observers_t * const self, wthal_observer_t * const elem) {
    DL_APPEND(self->head, elem);
    return true;
}

bool wthal_observers_delete(wthal_observers_t * const self, wthal_observer_t * const elem) {
    DL_DELETE(self->head, elem);
    return true;
}

typedef struct {
    
    bool (*enable)(void * const context, bool const enable);
    bool (*set_flag)(void * const context, bool const set);
    bool (*get_flag)(void * const context);
    bool (*set_priority)(void * const context, uint8_t const priority);
    uint8_t (*get_priority)(void * const context);
    bool (*add_observer)(void * const context, void (*callback)(void * const context), void * const callback_context);
    
} wthal_isr_impl_t;

