Wavetrend/RX14XX-TestApp/main.c
typedef struct {
    
    bool (*open)(void * const context);
    bool (*close)(void * const context);
    bool (*baudrate)(void * const context, uint32_t const baudrate);
    bool (*flowcontrol)(void * const context, bool const flowcontrol);
    size_t (*read)(void * const context, void * const data, size_t const size);
    size_t (*write)(void * const context, void const * const data, size_t const size);
    
} wthal_uart_impl_t;

typedef struct {
    
    wthal_uart_impl_t const * impl;
    void * context;
    
} wthal_uart_t;

wthal_uart_t * const wthal_uart_init(wthal_uart_t * const self, wthal_uart_impl_t const * const impl, void * const context) {
    self->impl = impl;
    self->context = context;
    return self;
}

bool wthal_uart_open(wthal_uart_t * const self) {
    return self->impl->open(self->context);
}

bool wthal_uart_close(wthal_uart_t * const self) {
    return self->impl->close(self->context);
}

bool wthal_uart_baudrate(wthal_uart_t * const self, uint32_t const baudrate) {
    return self->impl->baudrate(self->context, baudrate);
}

bool wthal_uart_flowcontrol(wthal_uart_t * const self, bool const flowcontrol) {
    return self->impl->flowcontrol(self->context, flowcontrol);
}

bool wthal_uart_read(wthal_uart_t * const self, void * const data, size_t const size) {
    return self->impl->read(self->context, data, size);
}

bool wthal_uart_write(wthal_uart_t * const self, void const * const data, size_t const size) {
    return self->impl->write(self->context, data, size);
}

#define DEFINE_UART(NAME, UART, XTAL) \
    DEFINE_ISR(NAME ## _tx, _U ## UART ## TXInterrupt, _U ## UART ## TXIF, _U ## UART ## TXIE, _U ## UART ## TXIP); \
    DEFINE_ISR(NAME ## _rx, _U ## UART ## RXInterrupt, _U ## UART ## RXIF, _U ## UART ## RXIE, _U ## UART ## RXIP); \
    DEFINE_ISR(NAME ## _err, _U ## UART ## ErrInterrupt, _U ## UART ## ERIF, _U ## UART ## ERIE, _U ## UART ## ERIP); \
    typedef struct { \
        uint32_t baudrate; \
        bool flowcontrol; \
        wthal_uart_t uart; \
        wthal_isr_t * tx_isr; \
        wthal_isr_t * rx_isr; \
        wthal_isr_t * err_isr; \
        NAME ## _tx_t _tx_isr; \
        NAME ## _rx_t _rx_isr; \
        NAME ## _err_t _err_isr; \
        wthal_observer_t tx_observers[1]; \
        wthal_observer_t rx_observers[1]; \
        wthal_observer_t err_observers[1]; \
        wt_rx14xx_uint8_buffer_t tx_buffer; \
        wt_rx14xx_uint8_buffer_t rx_buffer; \
        uint8_t tx_storage[256]; \
        uint8_t rx_storage[256]; \
    } NAME ## _t; \
    static void NAME ## _tx_isr_impl(void * const context) { \
        NAME ## _t * const self = context; \
        while (! U ## UART ## STAbits.UTXBF) { \
            uint8_t data; \
            if (wt_rx14xx_uint8_buffer_read(&self->tx_buffer, &data, sizeof(data), NULL)) { \
                U ## UART ## TXREG = data; \
            } else { \
                wthal_isr_enable(self->tx_isr, false); \
                break; \
            } \
        } \
    } \
    static void NAME ## _rx_isr_impl(void * const context) { \
        NAME ## _t * const self = context; \
        bool ok = true; \
        while (ok && U ## UART ## STAbits.URXDA) { \
            uint8_t data = U ## UART ## RXREG; \
            ok = !ok ? ok : wt_rx14xx_uint8_buffer_write(&self->rx_buffer, &data, sizeof(data), NULL); \
        } \
    } \
    static void NAME ## _err_isr_impl(void * const context) { \
        if (U ## UART ## STAbits.OERR == 1) { \
            U ## UART ## STAbits.OERR = 0; \
        } \
    } \
    static bool NAME ## _open_impl(void * const context) { \
        NAME ## _t * const self = context; \
        U ## UART ## MODE = 0x0000; \
        U ## UART ## MODEbits.BRGH = 1; \
        U ## UART ## STA = 0x0000; \
        wthal_uart_baudrate(&self->uart, self->baudrate); \
        wthal_uart_flowcontrol(&self->uart, self->flowcontrol); \
        wthal_isr_enable(self->tx_isr, false); \
        wthal_isr_enable(self->rx_isr, true); \
        wthal_isr_enable(self->err_isr, true); \
        U ## UART ## MODEbits.UARTEN = 1; \
        U ## UART ## STAbits.UTXEN = 1; \
        return true; \
    } \
    static bool NAME ## _close_impl(void * const context) { \
        NAME ## _t * const self = context; \
        wthal_isr_enable(self->tx_isr, false); \
        wthal_isr_enable(self->rx_isr, false); \
        wthal_isr_enable(self->err_isr, false); \
        U ## UART ## MODEbits.UARTEN = 0; \
        U ## UART ## STAbits.UTXEN = 0; \
        return true; \
    } \
    static bool NAME ## _baudrate_impl(void * const context, uint32_t const baudrate) { \
        NAME ## _t * const self = context; \
        self->baudrate = baudrate; \
        U ## UART ## BRG = (XTAL / (4 * self->baudrate)) - 1; \
        return true; \
    } \
    static bool NAME ## _flowcontrol_impl(void * const context, bool const flowcontrol) { \
        NAME ## _t * const self = context; \
        self->flowcontrol = flowcontrol; \
        U ## UART ## MODEbits.UEN = self->flowcontrol ? 2 : 0; \
        return true; \
    } \
    static size_t NAME ## _read_impl(void * const context, void * const data, size_t const size) { \
        NAME ## _t * const self = context; \
        return wt_rx14xx_uint8_buffer_read(&self->rx_buffer, data, size, NULL); \
    } \
    static size_t NAME ## _write_impl(void * const context, void const * const data, size_t const size) { \
        NAME ## _t * const self = context; \
        size_t written = wt_rx14xx_uint8_buffer_write(&self->tx_buffer, data, size, NULL); \
        if (written > 0) { \
            wthal_isr_set_flag(self->tx_isr, true); \
            wthal_isr_enable(self->tx_isr, true); \
        } \
        return written; \
    } \
    static wthal_uart_impl_t const NAME ## _impl = { \
        .open = NAME ## _open_impl, \
        .close = NAME ## _close_impl, \
        .baudrate = NAME ## _baudrate_impl, \
        .flowcontrol = NAME ## _flowcontrol_impl, \
        .read = NAME ## _read_impl, \
        .write = NAME ## _write_impl, \
    }; \
    wthal_uart_t * const NAME ## _init(NAME ## _t * const self, uint32_t const baudrate, bool const flowcontrol, uint8_t const tx_priority, uint8_t const rx_priority, uint8_t const err_priority) { \
        self->baudrate = baudrate; \
        self->flowcontrol = flowcontrol; \
        self->tx_isr = NAME ## _tx_init(&self->_tx_isr, tx_priority, self->tx_observers, 1); \
        self->rx_isr = NAME ## _rx_init(&self->_rx_isr, rx_priority, self->rx_observers, 1); \
        self->err_isr = NAME ## _err_init(&self->_err_isr, err_priority, self->err_observers, 1); \
        wthal_isr_add_observer(self->tx_isr, NAME ## _tx_isr_impl, self); \
        wthal_isr_add_observer(self->rx_isr, NAME ## _rx_isr_impl, self); \
        wthal_isr_add_observer(self->err_isr, NAME ## _err_isr_impl, self); \
        wt_rx14xx_uint8_buffer_init(&self->tx_buffer, self->tx_storage, 256, NULL); \
        wt_rx14xx_uint8_buffer_init(&self->rx_buffer, self->rx_storage, 256, NULL); \
        return wthal_uart_init(&self->uart, &NAME ## _impl, self); \
    }

DEFINE_UART(wt_rx14xx_debug_uart, 2, 14745600)

