Wavetrend/RX14XX-TestApp/main.c
//////////////////////////////// STDOUT ///////////////////////////////////////

static wthal_uart_t * wthal_stdout_uart = NULL;

int __attribute__ ( ( __section__(".libc.write" ) ) ) write(int handle, void * buffer, unsigned int len) {
    if (wthal_stdout_uart != NULL) {
        return (int) wthal_uart_write(wthal_stdout_uart, buffer, len);
    }
    return 0;
}

bool wthal_set_stdout(wthal_uart_t * const uart) {
    wthal_stdout_uart = uart;
    return true;
}

///////////////////////////////// MAIN ///////////////////////////////////////

int app_main(
    wthal_gpio_t * const startup_led,
    wthal_gpio_t * const activity_led,
    wthal_gpio_t * const xpc_reset,
    wthal_counter_t * const counter
) {
        // initialize the device
    SYSTEM_Initialize();
    uint32_t count = 0;

    wthal_counter_reset(counter);
    wthal_gpio_set(startup_led, true);
    while (wthal_counter_get(counter) < 3) {
        ClrWdt();
        Nop();
    }
    wthal_gpio_set(startup_led, false);
    
    while (1)
    {
        // Add your application code
        wthal_gpio_set(activity_led, true);
        wthal_counter_reset(counter);
        while(wthal_counter_get(counter) < 1) {
            ClrWdt();
            Nop();
        }
        wthal_gpio_set(activity_led, false);
        wthal_counter_reset(counter);
        while(wthal_counter_get(counter) < 1) {
            ClrWdt();
            Nop();
        }
        for (size_t i=0 ; i < 1 ; i++) {
            printf("\nHello World %ld", (uint32_t)count++);        
        }
    }

    return 1;

}

int main(void)
{
    wthal_observer_t t5_observers[5];
    wt_rx14xx_tmr5_t t5isr;
    wthal_isr_t * p_t5isr = wt_rx14xx_tmr5_init(&t5isr, wthal_isr_priority_4, t5_observers, sizeof(t5_observers) / sizeof(t5_observers[0]));
    
    wt_rx14xx_led1_t startup_led;
    wt_rx14xx_led2_t activity_led;
    wt_rx14xx_xpc_reset_t xpc_reset;
    wthal_gpio_t * const p_startup_led = wt_rx14xx_led1_init(&startup_led);
    wthal_gpio_t * const p_activity_led = wt_rx14xx_led2_init(&activity_led);
    wthal_gpio_t * const p_xpc_reset = wt_rx14xx_xpc_reset_init(&xpc_reset);
    wthal_gpio_weak_pull_up(p_xpc_reset, true);
    
    wt_rx14xx_timer5_t timer5;
    wthal_timer_t * const p_timer = wt_rx14xx_timer5_init(&timer5, wt_rx14xx_timer_prescale_256);

    wthal_counter_t t5counter;
    wthal_counter_init(&t5counter);
    wthal_isr_add_observer(p_t5isr, wthal_counter_isr, &t5counter);
    
    wthal_isr_enable(p_t5isr, true);
    wthal_timer_start(p_timer, 1000);
    
    wt_rx14xx_debug_uart_t debug;
    wthal_uart_t * p_debug = wt_rx14xx_debug_uart_init(&debug, 230400, true, 4, 4, 4);
    wthal_uart_open(p_debug);
    wthal_set_stdout(p_debug);
    
    return app_main(
        p_startup_led,
        p_activity_led,
        p_xpc_reset,
        &t5counter
    );

}
/**
 End of File
*/

